Klipper4FlashForge/helixscreen/firmware/helixscreen-esp32/sdkconfig.defaults
CONFIG_IDF_TARGET="esp32s3"
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ_240=y

CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_ESPTOOLPY_FLASHMODE_DIO=y
CONFIG_ESPTOOLPY_FLASHFREQ_80M=y
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"

CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_OCT=y
CONFIG_SPIRAM_SPEED_80M=y
CONFIG_SPIRAM_USE_MALLOC=y
CONFIG_SPIRAM_MALLOC_ALWAYSINTERNAL=0
CONFIG_SPIRAM_MALLOC_RESERVE_INTERNAL=65536

CONFIG_COMPILER_OPTIMIZATION_SIZE=y
CONFIG_COMPILER_CXX_EXCEPTIONS=y
CONFIG_COMPILER_CXX_RTTI=y

CONFIG_FREERTOS_HZ=1000
CONFIG_ESP32S3_DATA_CACHE_LINE_64B=y
CONFIG_PTHREAD_TASK_STACK_SIZE_DEFAULT=8192

# XML parse (expat) recursion needs a real stack (audit trap #4).
CONFIG_ESP_MAIN_TASK_STACK_SIZE=32768
CONFIG_FREERTOS_CHECK_STACKOVERFLOW_CANARY=y

# OTA A/B with rollback: new image must confirm healthy boot or the
# bootloader reverts to the previous slot.
CONFIG_BOOTLOADER_APP_ROLLBACK_ENABLE=y

# TLS to Moonraker is optional/LAN; the default cert bundle costs ~636KB.
CONFIG_MBEDTLS_CERTIFICATE_BUNDLE=n

# Separate TX lock for esp_websocket_client: without it a send can block 10s+
# behind an in-progress receive (esp-idf#14918), and Moonraker traffic is
# bidirectional (RPCs out while status streams in). Required by helixnet.
CONFIG_ESP_WS_CLIENT_SEPARATE_TX_LOCK=y

# WiFi + display + octal-PSRAM coexistence (2026-07-15 boot-reliability
# investigation, 20-reset harness verified; mirrors stock K-Touch firmware's
# published Arduino-ESP32/IDF-5.1.1 config). WiFi/LWIP buffers allocate from
# PSRAM so WiFi's variable internal-heap appetite cannot fragment internal
# SRAM out from under the UI (the draw buffers + UI task stack are static in
# .bss — see main/lvgl_glue.c). Static TX/RX buffer counts make the WiFi
# internal footprint deterministic.
CONFIG_SPIRAM_TRY_ALLOCATE_WIFI_LWIP=y
CONFIG_ESP_WIFI_STATIC_TX_BUFFER=y
CONFIG_ESP_WIFI_STATIC_TX_BUFFER_NUM=8
CONFIG_ESP_WIFI_CACHE_TX_BUFFER_NUM=16
CONFIG_ESP_WIFI_STATIC_RX_BUFFER_NUM=8

# Stock parity: adaptively drop PHY TX power after a brownout event — the
# board's 5V path is marginal under full-power TX bursts (weak-RSSI worst
# case), and stock ships this mitigation.
CONFIG_ESP_PHY_REDUCE_TX_POWER=y

# Stock parity: DOUT flash header — the shipped stock image runs DOUT@80m,
# not the QIO its build config nominally requested. (Stock's 32B data-cache
# line was tried and worsened scan-out: 64B lines give longer, more efficient
# PSRAM bursts for the framebuffer reads.)
CONFIG_ESPTOOLPY_FLASHMODE_DOUT=y

# Bounce-buffer scan-out must survive cache-disabled flash windows (WiFi PHY
# cal writes to NVS, OTA health marks otadata — both fire around first
# render). LCD_RGB_ISR_IRAM_SAFE is NOT usable here: the refill ISR reads the
# PSRAM framebuffer, which is unreachable while cache is off ("Cache disabled
# but cached memory region accessed" panic, measured). Instead the ISR pauses
# and DMA restarts on the next vsync, so an underrun costs one glitched frame
# rather than permanently desyncing the panel into its test pattern.
CONFIG_LCD_RGB_RESTART_IN_VSYNC=y
